print("Хотите сыграть в игру?")
answer = str(input("Напиши Да или нет на месте пробела: "))
if answer == str("Да"):
    print("Давай сыграем в игру - Ты мне век а я тебе скажу, что произошло в этом веке")
    century = int(input("Укажите век от 9 до 19, арабскими цифрами: "))
    if century == 9:
        print("Призвание ильменскими славянами и кривичами варяжских князей из племени русь - Рюрика, Синеуса и "
              "Трувора,"
              "862 г. Аскольд и Дир овладевают Киевом.")
    elif century == 10:
        print("Олег назначает Киев столицей Руси. Из Киева предпринимает поход в Царьград. Св.Ольга мстит древлянам "
              "за смерть своего мужа Игоря, а позднее принимает в Киеве христианство по православному обряду. "
              "Князь Святослав положил конец господству хазар на юге России. Завоевал Болгарское царство на Дунае, "
              "но оттуда был вытеснен греческим императором Иоанном Цимисхием. Владимир Святой покорил часть"
              "прикарпатских славян, "
              "затем - греческий город Корсунь, где и принял крещение по греческому обряду. Крещение Руси, 988 г")
    elif century == 11:
        print("Ярослав Мудрый победил печенегов при г.Киеве (Киево-Софийский собор); основал гг.Ярославль, Юрьев; издал"
              "'Русскую правду' и в 1054 г. положил начало разделению Руси.В княжение сына Ярослава, Изяслава I, "
              "преподобный Антоний основал Печерский монастырь, а преподобный Феодосии ввел в нем общежитие. "
              "В княжение Святополка II Изяславича ослеплен Давидом Василько, князь Галицкий.")
    elif century == 12:
        print("Княжение Владимира Мономаха в Киеве, 1113 - 1125. Усиление Владимиро-Суздальского княжества при Юрии I "
              "Долгоруком и Андрее Боголюбском. Основание г.Москвы Юрием I Долгоруким. Погром Киева войсками Андрея "
              "Боголюбского в 1169 г. Принятие титула великого князя Андреем Боголюбским. "
              "Великий Новгород достигает наивысшего торгового могущества.")
    elif century == 13:
        print("Первое появление татар и победа их при реке Калке над галицким князем Мстиславом Удалым и другими южными"
              "князьями, 1223. Нашествие Батыя на Северо-Восточную Русь, 1237, и гибель великого князя Владимирского "
              "в сражении с татарами при р.Сити. Разорение Батыем Юго-Западной Руси. Начало Золотой орды. "
              "Ярослав II Всеволодович первым из князей признан Батыем старшим между всеми русскими князьями. "
              "Победа Александра Ярославовича над шведами, 1240, и над ливонскими рыцарями на Чудском озере "
              "(Ледовое побоище).")
    elif century == 14:
        print("1. Великое княжество Литовско-Русское. Литовские князья - Гедимин (основатель Вильно), Ольгерд и "
              "Витовт - "
              "присоединяют к Литве русские юго-западные земли. Сын Ольгерда Ягайло делается польским королем и "
              "обращает "
              "в католичество литовский народ, 1386. 2. Великое княжество Московское. Московский князь Иоанн Калита, "
              "1328-1341, приобретает в орде у хана Узбека титул великого князя; при нем же митрополит св.Петр "
              "переселился "
              "из г.Владимира на Клязьме в Москву. "
              "Митрополит св.Алексий и игумен и основатель Троице-Сергиева монастыря преп.Сергий с"
              "пособствуют усилению Москвы в княжение Димитрия Донского, внука Калиты. Победа Димитрия Донского "
              "над ханом "
              "Мамаем и его полчищами на Куликовом поле 8 сентября 1380. Разорение Тохтамышем Москвы.")
    elif century == 15:
        print("Иоанн III, 1462Ч1505. Брак его с Софией Палеолог, племянницей последнего византийского императора, "
              "и вывоз "
              "в Москву из Италии и других западных стран мастеров и сведущих людей. Новгородские бояре, с "
              "Марфой-посадницей во главе, пытались отдаться под покровительство польского короля и великого князя "
              "литовского Казимира IV, сына Ягайло, но Иоанн III не допустил совершиться этому и подчинил Новгород "
              "Москве. "
              "Он положил также конец Тверскому княжеству и присоединил к России Чернигов, Новгород-Северск и некоторые"
              "другие "
              "города Литовской Руси. Поход хана Золотой орды Ахмата на Московское царство и свержение Иоанном III "
              "монгольского ига, продолжавшегося от 1240 до 1480.")
    elif century == 16:
        print("1. Великое княжество Московское. Василий III присоединяет Псков, Рязань, Новгород-Северск; "
              "он же отвоевал у Литвы Смоленск. Иоанн IV. Принятие им титула царя, 1547. Завоевание Казани, 1552, "
              "Астрахани и последняя война с Ливонией. Оборона Пскова от Стефана Батория. Завоевание Сибири донскими "
              "казаками под предводительством Ермака, 1582. Заведение в Москве типографии и учреждении стрелецких "
              "полков. "
              "Указ царя Феодора Иоанновича о прикреплении крестьян к земле. Прекращение царствующей линии из Рюрикова "
              "дома, 1598. "
              "2. Польша. Соединение великого княжества Литовско-Русского с царством Польским на сейме в Люблине, "
              "1569, "
              "при последнем короле из дома Ягелонов Сигизмунде II Августе. Церковный собор в Бресте, 1596, объявление"
              "Сигизмундом III униатской церкви господствующей в русских областях.")
    elif century == 17:
        print("1. Смутное время. Царствование Бориса Годунова и Василия Шуйского, последнего царя из дома Рюриковичей. "
              "Во время управления Боярской думы польские войска под начальством гетмана Жолкевского утверждаются в "
              "Москве, а польский король Сигизмунд III захватывает Смоленск. Патриотические воззвания к народу "
              "патриарха"
              "Ермогена, архимандрита Троицкой лавры Дионисия и келаря Авраамия Палицына. Подвиг Минина и Пожарского. "
              "2. Царь Михаил Феодорович. "
              "Избрание на Земском соборе Михаила Феодоровича, первого царя из дома Романовых, "
              "1613. Земельные уступки Михаила Феодоровича Швеции и Польше. Патриарх Филарет. "
              "3. Царь Алексей Михайлович."
              "Исправление богослужебных книг при патриархе Никоне. Восстание Малороссии против владычества поляков "
              "под предводительством Богдана Хмельницкого: битвы при Корсуне и Берестечке. Подданство Малороссии Москве"
              "1654. Война с Польшей. Воссоединение с Москвой части Малороссии с гг.Смоленском и Киевом. "
              "4. Петр I Великий, 1689-1725. Возмущение стрельцов и правлений Софьи. Завоевание Петром Азова. "
              "Первое путешествие Петра за границу.")
    elif century == 18:
        print("Продолжение царствования Петра I Великого. 1. Время Великой Северной воины, 1700-1721; поражение русских"
              "при Нарве; взятие Петром крепости Нотебург (Орешек) и основание Петербурга, 1703, и Кронштадта;поражение"
              "Карла XII при Полтаве, 1709, июня 27, и бегство его с Мазепой в Турцию; война с Турцией и потеря, Азова;"
              "перенесение столицы из Москвы в Петербург и учреждение флота на Финском заливе. Присоединение к России "
              "по"
              "Ништадтскому миру, 1721, Лифляндии, Истляндии, Ингрии и части Финляндии с г.Выборгом. Принятие Петром I "
              "титула императора и названия " "Великого Учреждение регулярного постоянного войска, флота, Сената, "
              "Синода, училищ для дворян и т.п., разделение России на губернии, введение чинов, титулов и орденов. "
              "2. Ближайшие преемники Петра Великого: Екатерина I, Петр II, Анна Иоанновна, Иоанн VI, Елизавета. "
              "Открытие Академии Наук при императрице Екатерине I. Учреждение Московского университета, Академии "
              "Художеств и первого русского театра при императрице Елизавете. Ломоносов. 3. Императрица Екатерина II, "
              "1762-1796. В первую турецкую войну русский флот, под начальством Алексея Орлова (Чесменского), сокрушил "
              "турецкий флот у Чесменской бухты, против острова Хиоса, 1771; сухопутные войска под начальством"
              " Румянцева"
              "(Задунайского) победили крымских татар у р.Ларги и турецкие войска - при р.Кагуле, 1771. Мир в "
              "дер.Кайнарджи. "
              "Потемкин (князь Таврический) основал в Новороссии гг.Екатеринославль, Херсон, Николаев, уничтожил "
              "Запорожскую сечь, окончательно присоединил к России Крым, 1783, и положил начало Черноморскому флоту.Во "
              "вторую турецкую войну Суворов (граф Рымникский, князь Италийский, фельдмаршал и генералиссимус) одержал "
              "над турками, в союзе с австрийцами, блестящую победу при г.Рымнике, взял приступом без помощи австрийцев"
              "крепость Измаил. (Во время войны с Польшей взял штурмом Прагу, предместье Варшавы.) Воссоединение с "
              "Россией Белоруссии, Полесья, Подолии и Волыни и присоединение к России по третьему разделу Польши,1795, "
              "Литвы и Курляндии. Первое женское закрытое училище в Петрограде. Воспитательные дома в Петербурге и в "
              "Москве. Введение оспопрививания." "4. Император Павел I. Поход Суворова в Италию: сражение при г. Нови,"
              " переход через Сен-Готард, предательство австрийцев. Закон об императорской фамилии; освобождение "
              "крепостных от работы на помещиков в праздничные дни; преобразование армии по прусскому образцу.")
    elif century == 19:
        print("1. Император Александр I, 1801-1825. После неудачной войны с Наполеоном I примиряется с ним и "
              "приобретает Белостокскую область, которая со времени раздела Польши принадлежала Пруссии. Отвоевание у "
              "Швеции Финляндии до р.Торнео, 1809, у Турции Ч Бессарабии до р. Прут. Отечественная война, 1812. "
              "Главнокомандующие: Барклай де Толли, а затем Голенищев-Кутузов; другие военачальники: князь Витгенштейн,"
              "победивший французов при Западной Двине; Багратион, павший при Бородине; Ермолов, Дохтуров и Раевский. "
              "Главные битвы: при Бородине 26 августа, при Малоярославце, при Вязьме, при Духовщине и Красном. Война "
              "за освобождение Европы. Победа над Наполеоном в Лейпциге; взятие Парижа, 1814. Низложение Наполеона. "
              "Приобретение Россией польских земель, отошедших к Пруссии по второму и третьему разделам Польши. Отмена "
              "пыток при суде. - Запрещение продавать крестьян без земли. Учреждение министерств и государственного "
              "совета. Открытие новых высших и средних учебных заведений. 2. Император Николай I, 1825-1855. "
              "Персидская война и присоединение к России земель по левому берегу р.Аракс. Турецкая война и приобретение "
              "Россией по Адрианопольскому миру Килийского рукава Дуная с гг.Измаил и Килия и азиатских крепостей: Поти, "
              "Анапы и Ахалцыха. Крымская кампания, 1853-1856. Открытые союзники Турции: Франция (Наполеон III), "
              "Англия (Виктория), Австрия и Сардиния и тайный союзник - Пруссия (Вильгельм IV). Героическая оборона "
              "Севастополя, сначала под начальством князя Меньшикова, затем - князя Горчакова. Устроители "
              "Севастопольских укреплений на суше: инженер Тотлебен, князь Васильчиков. Герои-адмиралы: Нахимов, "
              "Корнилов и др. Место потопления Черноморского флота - севастопольский рейд; место наиболее обагренное "
              "русской кровью - Малахов курган. На основании Парижского мира Россия возвратила Турции Килийский рукав "
              "Дуная и обязалась не держать на Черном море военного флота, крепостей и арсеналов. Издание свода "
              "законов. - Усмирение Польши. Отмена унии в Западной России. 3. Император Александр II, 1855-1881. "
              "Приобретение Приамурского края и других земель на отдаленном Востоке. Окончательное покорение "
              "Кавказа под начальством князя Барятинского. Завоевание земель Средней Азии по рр.Сырдарье и "
              "Амударье при начальниках войск Черняеве и Кауфмане. Возвращение Россией права держать на Черном море "
              "флот. Война за освобождение балканских славян (1877-1878) под главным начальством великих князей: "
              "Николая Николаевича Старшего и Михаила Николаевича. Места, наиболее прославленные доблестями "
              "русских войск: Плевна, болгарское земляное укрепление, и Шипка - балканский проход. Военачальники: "
              "Скобелев, Гурко, Радецкий и др. По миру в Сан-Стефано Россия приобрела: Килийский рукав Дуная, "
              "крепости Каре, Батум и т.д. Освобождение крестьян, 1861, 19 февраля. "
              "Введение земских учреждений, гласного суда и всеобщей воинской повинности. "
              "4. Император Александр III, 1881-1894. "
              "Увеличение войска. Упразднение подушной подати. Учреждение Дворянского и Крестьянского земельных "
              "банков. Учреждение Добровольного торгового Черноморского флота. 5. Император Николай II.")
    else:
        print("Кажется, ты подумал что надо указать век до нашей эры), проверь ещё раз данные, которые ты ввёл!")

elif answer == str("Нет"):
    print("Не хочешь как хочешь, сам поиграю)")
else:
    print("Хм-хм, что-то не так, посмотри внимательнее")